{
  "name": "工厂投掷器",
  "icon": "engineersdecor:factory_dropper",
  "category": "engineersdecor:automation",
  "sortnum": 6020,
  "pages": [
    {
      "type": "spotlight",
      "title": "工厂投掷器",
      "item": "engineersdecor:factory_dropper",
      "text": "一个用于精确投掷物品的设备，适用于自动化结设计。$(br)正面的金属活动门用于保护内部，而且只在$(t:……这对你来说是一个视觉指示，继续读……)准备投掷$()或正在从 12 个内部存储格投掷时打开。排出物品后，选中的格子前进到下一个合适的存储格（所以叫$(o)轮$()"
    },
    {
      "type": "text",
      "text": "$(o)询$()操作——在 GUI 里当前格会被红框标记）。三个过滤器槽（堆叠比较器）可以帮助高级自动化。$(br)投掷器可以面向任何方向，潜行右击还可以反转放置的方向。$(br)默认情况下这个方块就像圆石制成的投掷器，在收到的外部信号里发现$(t:即关->开，或者说从 0 到非 0)上升沿$()时吐出一个物品。这个行为可以在 GUI 里调节，就像其他特性一样。$(br)"
    },
    {
      "type": "text",
      "text": "$(l)定位$()$(br)你对角度和力度的调整具有$(t:……技术术语，意味着结果将相当准确地保持不变，即使数值精确来说可能不是它应该是的值——那就叫准确度。换句话说，投掷器投掷的物品会一直落在第一次落下的地方。)高可重现性$()。看看投掷器的正面，你会看见一个 x-y 座标系统（红线和绿线）。同样的两条线画在了 GUI 的右上区域。点击该处会将准星从中央移开，在上下左右四个方向的 -45° 到 45° 间调整投掷角度。在座标系统的左边有一个竖直的弹簧，可以用于调整投掷的力道。"
    },
    {
      "type": "text",
      "text": "$(l)堆叠数量$()$(br)在定位控制下方的横向滑动条（标记着 1 到 5 个点）用于设置同时投掷的物品数量。范围从 1 到 32。$(br)如果一个堆叠没有这么多物品，它会被跳过。这对需要特定数量的自动化很有用，比如 $(o)IE 金属冲压机$()，或者世界内合成设计。"
    },
    {
      "type": "text",
      "text": "$(l)投掷延迟/间隔$()$(br)在堆叠下的横向滑动条用于以 0.1 秒为步长调整冷却时间（投掷后的延迟；图标用狗和蜗牛代表快和慢）。$(br2)如果你的设计或设备需要一些处理时间——这意味着防止物品堆积或物品消失，这是很有用的。"
    },
    {
      "type": "text",
      "text": "$(l)过滤器槽$()$(br)这些槽内的堆叠会和存储内的所有堆叠比较。如果物品相同，而且存储内物品的堆叠大小大于等于过滤器内物品的堆叠大小，对应过滤器的输出会为开，LED 灯也会变绿。如果没有相同的物品或者找到的堆叠大小太小，对应过滤器槽输出为关，LED灯为红色。如果过滤器槽没有放入物品，LED 灯不会亮起，其输出也会被忽略。"
    },
    {
      "type": "text",
      "text": "$(l)红石控制$()$(br)在 GUI 的更下方，有一个带着向下箭头的红石 LED 和三个连起来的电路元素。LED 会在收到外部红石信号时亮起，也能作为试触发按钮。再下面是两个逻辑门，最右边是触发控制。$(br)让我们从电路末端开始：如果你点击了触发控制，$(t:这些符号是一种技术表示，展示了如果你接上一个拉杆并把它打开会发生什么。一条曲线随着拉杆信号上升并保持不变，这叫做台阶。另一个也随着拉杆信号上升，但过了一段时间，它又自己下降了，尽管拉杆还开着，这叫做脉冲。)它的符号会在$(o)脉冲模式$()和$(o)持续模式$()间变化。"
    },
    {
      "type": "text",
      "text": "触发控制的输入来自于中间逻辑门的输出。单击这个逻辑门可以在$(t:这些图标实际上是电路里的 IEC 标志图标。与意味着所有输入必须为开。或意味着只需要一个输入为开，不管是哪一个，总共有几个。这就是为什么图标为“>=1”。)$(o)与（“&”）和或（“>=1”）逻辑间切换$()$()。其中一个输入来自外部红石信号，另一个来自过滤器。最后，你可以对来自过滤器槽的三条线做一样的事。$(o)&$()：所有过滤器必须为绿灯，$(o)>=1$()：至少一个过滤器为绿灯。$(br2)那现在这些又意味着什么？好吧，你可以触发式或持续地投掷物品。你也可以"
    },
    {
      "type": "text",
      "text": "让投掷器需要外部红石信号，或者让它在匹配到物品时自行投掷。你还可以决定过滤器的堆叠是一起掷出还是单独投掷。$(br2)$(l)活动门作为指示器$()$(br)正面的活动门能帮你了解内部条件是否满足，而且不需要打开 GUI。如果过滤器槽内有物品而且所有过滤器匹配（绿灯），投掷器"
    },
    {
      "type": "text",
      "text": "只需等待外部红石信号，活动门就会打开。$(br2)$(l)更多细节$()$(br)$(li)在投掷器等待延迟倒计时结束时，延迟滑动条上的黄色 LED 指示灯会闪烁。$(li)在第二个逻辑门的“外部红石输入”和“过滤器槽输出”进行逻辑或时，如果没有任何过滤器槽被匹配到，作为代替，投掷器会掷出不在过滤器内的一个物品（对清理很有帮助）。"
    },
    {
      "type": "text",
      "text": "$(li)与上一条不同，在第二个逻辑门的“外部红石输入”和“过滤器槽输出”进行逻辑与时，只有匹配过滤器的物品会被排出，其他会留在存储格内直到被用其他方法移出。"
    },
    {
      "type": "text",
      "text": ""
    }
  ]
}
